[
    {
        "text": "It is often said that the younger generation has lost its enthusiasm for learning and hard work, but I completely disagree!\nIn fact, nothing makes me prouder than seeing the passion and eagerness these young people have for learning, growing and achieving more in life.",
        "engagement": 616,
        "line_count": 2,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "Sargodha! What an amazing crowd with the passion to learn!\nThis Artificial Intelligence conference was a gateway towards the next level mindset, the mindset that wants to learn, adopt new technology & grow in their domains.\nGood luck to all the attendees in their career building!",
        "engagement": 1208,
        "line_count": 3,
        "language": "English",
        "tags": [
            "Career Building",
            "Artificial Intelligence"
        ]
    },
    {
        "text": "Celebrating a successful milestone or project with the team always brings me so much energy and motivation.\nToday, we had a great time with one of our teams from the Artificial Intelligence Department. Like the other departments, they are doing incredible work. I always feel blessed to have a team like this, people who are truly committed to turning complex challenges into simple solutions through their focus, dedication, and hard work.\nTogether, InshAllah, we will grow, and together, we will rise!",
        "engagement": 1217,
        "line_count": 3,
        "language": "English",
        "tags": [
            "Artificial Intelligence",
            "Team Celebration"
        ]
    },
    {
        "text": "The Atlantic International Business Network (AIBN) Healthcare Roadshow 2024 in #Qatar is unlocking incredible opportunities for Pakistan’s healthcare sector.\nEven before the exhibition begins, Xeven Solutions in partnership with Atlantic International Business Network, has reached a groundbreaking milestone.\nThis is a golden chance to showcase your healthcare innovation at the Qatar Healthcare Roadshow, happening in Doha from November 18th to 20th.\nDon’t miss out on this unparalleled opportunity to gain international visibility and make impactful connections in the healthcare industry.",
        "engagement": 429,
        "line_count": 4,
        "language": "English",
        "tags": [
            "Qatar"
        ]
    },
    {
        "text": "From ten days of intense business meetings in Riyadh to stepping back into the shoes of a student for my defense in London. It is a challenging shift.",
        "engagement": 1578,
        "line_count": 2,
        "language": "English",
        "tags": [
            "Meetings",
            "Student Life"
        ]
    },
    {
        "text": "On day two of the Global Health Exhibition - ملتقى الصحة العالمي, my last day here before traveling to London tomorrow, I was struck by how many companies are showcasing AI implementation. However, in reality, only about 10% are genuinely leveraging AI, while the remaining 90% are simply displaying AI-like features but relying on conventional rule-based engines.\nI'm not saying this is the wrong approach, but here's how it should be done:\nThe first step is raising awareness and then finding the right partners to help implement AI. Next, you need to develop a research and development wing. With patience and consistency, that's when you'll start seeing real results, what we can truly call AI magic.",
        "engagement": 1517,
        "line_count": 6,
        "language": "English",
        "tags": [
            "Healthcare",
            "Artificial Intelligence"
        ]
    },
    {
        "text": "Innovation in AI and healthcare requires more than just technology; teamwork is the key to success!",
        "engagement": 831,
        "line_count": 1,
        "language": "English",
        "tags": [
            "Healthcare",
            "Artificial Intelligence"
        ]
    },
    {
        "text": "Day 1 of the Global Health Exhibition was filled with innovation and exploration, and so many exciting things are going to happen tomorrow.\nSomething big is on its way, and we’re preparing for it. Stay tuned!",
        "engagement": 928,
        "line_count": 2,
        "language": "English",
        "tags": [
            "Innovation",
            "Healthcare"
        ]
    },
    {
        "text": "\"One day, you will tell your story of how you overcame what you went through, and it will be someone else's survival guide,\"",
        "engagement": 1601,
        "line_count": 1,
        "language": "English",
        "tags": [
            "Motivation"
        ]
    },
    {
        "text": "No matter where you go in the world, you will find Pakistani talent. They have potential, dedication, and commitment, and they're doing great work everywhere.\nWhat we need to focus on is making things easier for them and providing them with the respect and support they deserve. They are truly our strength.",
        "engagement": 637,
        "line_count": 3,
        "language": "English",
        "tags": [
            "Talent",
            "Support"
        ]
    },
    {
        "text": "My students arranged a lovely meetup in Karachi! I’m genuinely impressed by how concerned our youth is about their future & it felt so good to see them working so hard to achieve their goals. Their passion for learning, growing and succeeding in their careers is highly appreciated. May you all achieve your goals!",
        "engagement": 1860,
        "line_count": 4,
        "language": "English",
        "tags": [
            "Students",
            "Career Building"
        ]
    }
]